Tekla Open API Reference for Tekla Structures 2025
RebarMesh.MeshType Property
 The type of the reinforcement mesh. The options are:
RECTANGULAR_MESH
POLYGON_MESH
BENT_MESH
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarMesh.RebarMeshTypeEnum MeshType { get; set; }
Public Property MeshType As RebarMesh.RebarMeshTypeEnum
	Get
	Set
Property Value
Type: RebarMesh.RebarMeshTypeEnum
Remarks
It is not possible to change the type of existing rebar meshes.
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace